tests/Mock/RefundFailure.txt

HTTP/1.1 400 Bad Request
Content-Type: application/json

{
    "error_code": 23002,
    "message": "sum is larger than the original debit transaction",
    "transaction_result": {
        "processor_response_code": "002",
        "transaction_id": null,
        "auth_number": null,
        "card_type": null,
        "card_type_name": null,
        "currency_code": "ILS",
        "amount": 10.00,
        "txn_type": "credit",
        "tranmode": "A"
    }
} 